<template>
  <div class="home" v-if="isRouterAlive">
    <div class="sea">
      <p class="title">铜谷中学莎莎老师课堂点名系统</p>
      <span class="wave"></span>
      <span class="wave"></span>
    </div>
    <div class="home-center">
      <div class="center_left">
        <svg t="1586312799662" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1119" width="226" height="226"><path d="M725.626509 1007.406685H547.074492c-8.445699 0-15.202259-6.855921-15.202259-15.202258 0-8.445699 6.855921-15.202259 15.202259-15.202259H725.626509c8.445699 0 15.202259 6.855921 15.202258 15.202259s-6.855921 15.202259-15.202258 15.202258z" fill="#FFFFFF" p-id="1120"></path><path d="M473.64659 86.229307c-1.68914-1.589779-1.788501-4.173169-0.298084-5.96167L504.249829 46.286118c1.589779-1.68914 4.173169-1.788501 5.96167-0.298084 1.68914 1.589779 1.788501 4.173169 0.298083 5.96167L479.60826 86.030585c-1.589779 1.589779-4.27253 1.788501-5.96167 0.198722z" fill="#EF8218" p-id="1121"></path><path d="M506.137691 84.639528l-34.08088-30.901323c-1.68914-1.589779-1.788501-4.173169-0.298084-5.96167 1.589779-1.68914 4.173169-1.788501 5.96167-0.298083l34.080881 30.901323c1.68914 1.589779 1.788501 4.173169 0.298083 5.96167s-4.27253 1.887862-5.96167 0.298083z" fill="#EF8218" p-id="1122"></path><path d="M362.633619 53.247523a12.320785 2.285307 42.228 1 0 3.07183-3.38443 12.320785 2.285307 42.228 1 0-3.07183 3.38443Z" fill="#E61F19" p-id="1123"></path><path d="M358.401255 63.54006a12.320785 2.285307 12.228 1 0 0.968067-4.466918 12.320785 2.285307 12.228 1 0-0.968067 4.466918Z" fill="#E61F19" p-id="1124"></path><path d="M347.55969 76.164142a2.285307 12.320785 72.232 1 0 23.466166-7.519707 2.285307 12.320785 72.232 1 0-23.466166 7.519707Z" fill="#E61F19" p-id="1125"></path><path d="M356.742219 90.92098a2.285307 12.320785 42.228 1 0 16.561169-18.246497 2.285307 12.320785 42.228 1 0-16.561169 18.246497Z" fill="#E61F19" p-id="1126"></path><path d="M372.242262 99.177593a2.285307 12.320785 12.228 1 0 5.219144-24.082514 2.285307 12.320785 12.228 1 0-5.219144 24.082514Z" fill="#E61F19" p-id="1127"></path><path d="M383.729379 87.429257a12.320785 2.285307 72.232 1 0 4.352595-1.394785 12.320785 2.285307 72.232 1 0-4.352595 1.394785Z" fill="#E61F19" p-id="1128"></path><path d="M393.796092 82.563103a12.320785 2.285307 42.228 1 0 3.071829-3.384431 12.320785 2.285307 42.228 1 0-3.071829 3.384431Z" fill="#E61F19" p-id="1129"></path><path d="M400.099646 73.381233a12.320785 2.285307 12.228 1 0 0.968067-4.466918 12.320785 2.285307 12.228 1 0-0.968067 4.466918Z" fill="#E61F19" p-id="1130"></path><path d="M388.594838 63.848797a2.285307 12.320785 72.232 1 0 23.466166-7.519708 2.285307 12.320785 72.232 1 0-23.466166 7.519708Z" fill="#E61F19" p-id="1131"></path><path d="M386.198153 59.751712a2.285307 12.320785 42.228 1 0 16.561168-18.246496 2.285307 12.320785 42.228 1 0-16.561168 18.246496Z" fill="#E61F19" p-id="1132"></path><path d="M382.10448 57.382095a2.285307 12.320785 12.228 1 0 5.219144-24.082514 2.285307 12.320785 12.228 1 0-5.219144 24.082514Z" fill="#E61F19" p-id="1133"></path><path d="M371.41373 46.394156a12.320785 2.285307 72.232 1 0 4.352595-1.394784 12.320785 2.285307 72.232 1 0-4.352595 1.394784Z" fill="#E61F19" p-id="1134"></path><path d="M284.037527 26.196337a15.003536 15.003536 0 1 0 20.167229-22.219524 15.003536 15.003536 0 1 0-20.167229 22.219524Z" fill="#2C65AF" p-id="1135"></path><path d="M267.869613 133.624584c-1.589779 1.68914-4.173169 1.788501-5.96167 0.298083L227.926424 102.921983c-1.68914-1.589779-1.788501-4.173169-0.298084-5.96167 1.490418-1.788501 4.173169-1.788501 5.96167-0.298084l34.080881 30.901323c1.589779 1.589779 1.788501 4.27253 0.198722 6.061032z" fill="#2C65AF" p-id="1136"></path><path d="M266.279834 101.034121l-30.901323 34.08088c-1.589779 1.68914-4.173169 1.788501-5.96167 0.298084-1.68914-1.589779-1.788501-4.173169-0.298083-5.96167l30.901323-34.080881c1.589779-1.68914 4.173169-1.788501 5.96167-0.298083 1.68914 1.589779 1.887862 4.27253 0.298083 5.96167z" fill="#2C65AF" p-id="1137"></path><path d="M182.120926 237.556364c-14.109286 15.599703-38.154688 16.891398-53.65503 2.881474-15.500342-14.009925-16.493954-38.055327-2.285307-53.65503 14.109286-15.599703 38.154688-16.891398 53.65503-2.881474s16.493954 38.055327 2.285307 53.65503z m-48.587611-44.116358c-10.432923 11.426534-9.638033 29.212183 1.68914 39.446383 11.327173 10.333561 29.013461 9.33995 39.446383-2.086584 10.432923-11.426534 9.638033-29.212183-1.689139-39.446384-11.327173-10.333561-29.013461-9.439311-39.446384 2.086585z" fill="#E62A52" p-id="1138"></path><path d="M583.738762 593.567425m-415.230316 0a415.230316 415.230316 0 1 0 830.460633 0 415.230316 415.230316 0 1 0-830.460633 0Z" fill="#61C3E6" p-id="1139"></path><path d="M159.367219 408.556932c-2.484029 0-4.968058-0.596167-7.352727-1.887862-7.352726-4.073808-10.035478-13.314396-5.96167-20.667123 30.801962-55.940337 74.620236-105.124115 126.586127-142.483913 6.855921-4.868697 16.295231-3.37828 21.26329 3.477641 4.868697 6.855921 3.37828 16.295231-3.477641 21.26329-48.289527 34.677047-88.928244 80.482545-117.643622 132.349074-2.881474 5.166781-8.048255 7.948893-13.413757 7.948893z" fill="" p-id="1140"></path><path d="M523.128451 1024c-58.126283 0-114.464064-11.426534-167.522928-33.882158-51.270362-21.660734-97.274582-52.76078-136.820326-92.306524-39.545744-39.545744-70.546428-85.549965-92.306525-136.820327-22.356263-53.058863-33.782797-109.396645-33.782796-167.423566 0-47.097193 7.551449-93.498858 22.554985-137.714577 2.682752-7.948893 11.327173-12.221424 19.276066-9.538672 7.948893 2.682752 12.221424 11.327173 9.538672 19.276066-13.811202 41.135523-20.865845 84.25827-20.865845 128.076544 0 220.58179 179.446267 399.928697 399.928697 399.928697 72.533652 0 143.576886-19.57415 205.379532-56.735226 7.154004-4.371891 16.593315-1.987223 20.865845 5.266141 4.371891 7.154004 1.987223 16.593315-5.266142 20.865846-66.472621 39.943189-142.881358 61.007756-220.979235 61.007756z" fill="" p-id="1141"></path><path d="M782.461096 933.183893c-4.471253 0-8.843144-1.987223-11.92334-5.762947-5.266142-6.557837-4.173169-16.096509 2.384668-21.362651 38.452772-30.801962 70.64579-67.963038 95.486082-110.390257 4.27253-7.253365 13.61248-9.638033 20.865845-5.464864 7.253365 4.27253 9.638033 13.61248 5.464864 20.865845-26.827515 45.706137-61.30584 85.649326-102.739447 118.736595-2.881474 2.285307-6.259754 3.37828-9.538672 3.378279z" fill="" p-id="1142"></path><path d="M906.861277 767.846912c-1.987223 0-3.875086-0.397445-5.862309-1.192334-7.750171-3.179557-11.426534-12.122062-8.246976-19.872234 20.170317-48.587611 30.404517-100.156056 30.404517-153.31428 0-220.58179-179.446267-399.928697-399.928697-399.928697-54.052475 0-106.41581 10.631645-155.698949 31.398129-7.750171 3.278919-16.692676-0.397445-19.971594-8.147616-3.278919-7.750171 0.397445-16.692676 8.147615-19.971594 53.058863-22.455624 109.396645-33.882158 167.522928-33.882158s114.464064 11.426534 167.522927 33.882158c51.270362 21.660734 97.274582 52.76078 136.820327 92.306524s70.546428 85.549965 92.306524 136.820327c22.455624 53.058863 33.882158 109.396645 33.882158 167.522927 0 57.132671-11.02909 112.576202-32.789185 164.939537-2.484029 5.96167-8.147616 9.439311-14.109286 9.439311z" fill="" p-id="1143"></path><path d="M725.72587 343.67409c-3.676363 0-7.452088-1.291695-10.432923-4.073808-13.910563-13.016313-28.9141-25.138375-44.414441-35.968742-6.855921-4.769336-8.644422-14.208647-3.875086-21.163928 4.769336-6.855921 14.208647-8.644422 21.163929-3.875086 16.792037 11.625257 32.888546 24.641569 47.892082 38.651494 6.160392 5.762948 6.458476 15.30162 0.695528 21.462012-2.881474 3.37828-6.955282 4.968058-11.029089 4.968058z" fill="#FFFFFF" p-id="1144"></path><path d="M817.734311 468.372355c-5.564225 0-11.02909-3.179557-13.711842-8.545061-14.109286-28.9141-31.49749-56.039698-51.667806-80.681267-5.266142-6.557837-4.371891-16.096509 2.086584-21.462012 6.557837-5.266142 16.096509-4.371891 21.462012 2.086584 21.660734 26.43007 40.340634 55.642253 55.443531 86.543577 3.676363 7.551449 0.596167 16.692676-6.955281 20.369039-2.185946 1.192334-4.471253 1.68914-6.657198 1.68914z" fill="#FFFFFF" p-id="1145"></path><path d="M702.674079 460.224739H313.675111c-8.445699 0-15.202259-6.855921-15.202259-15.202258 0-8.445699 6.855921-15.202259 15.202259-15.202259h388.998968c8.445699 0 15.202259 6.855921 15.202259 15.202259s-6.756559 15.202259-15.202259 15.202258zM702.674079 608.769684H313.675111c-8.445699 0-15.202259-6.855921-15.202259-15.202259 0-8.445699 6.855921-15.202259 15.202259-15.202258h388.998968c8.445699 0 15.202259 6.855921 15.202259 15.202258 0 8.445699-6.756559 15.202259-15.202259 15.202259zM702.674079 757.314628H313.675111c-8.445699 0-15.202259-6.855921-15.202259-15.202258 0-8.445699 6.855921-15.202259 15.202259-15.202259h388.998968c8.445699 0 15.202259 6.855921 15.202259 15.202259 0 8.445699-6.756559 15.202259-15.202259 15.202258z" fill="#FF9D00" p-id="1146"></path></svg>
      </div>
      <div class="center_right">
        <el-form :model="ruleForm" status-icon :rules="rules" ref="ruleForm" label-width="100px" class="demo-ruleForm">
          <el-form-item label="账号：" prop="loginName">
            <el-input v-model.number="ruleForm.loginName"></el-input>
          </el-form-item>
          <el-form-item label="密码：" prop="password">
            <el-input type="password" v-model="ruleForm.password" autocomplete="off"></el-input>
          </el-form-item>
          <el-form-item label="验证码：" prop="yzPass">
            <el-input v-model="ruleForm.yzPass" clearable autocomplete="off" style="width: 220px"></el-input>
            <span @click="randomStr">
              <verification-code class="canvasYzm" :identifyCode="randomNumber"></verification-code>
            </span>
          </el-form-item>
          <el-form-item>
            <!-- style="margin-top: 16px; margin-left: 40%"  -->
            <div class="loginBtn">
              <el-button @click="resetForm('ruleForm')">重 置</el-button>
              <span style="display: inline-block; margin-left: 30px;">
                <el-button type="primary" @click="submitForm('ruleForm')" >登 录</el-button>
              </span>
            </div>
          </el-form-item>
        </el-form>
      </div>
      <div class="center_bottom">
        <router-link to="./newpassword" class="changePss">修改密码</router-link>
      </div>
    </div>
    <div class="bottom">
    </div>
  </div>
</template>

<script>
  import api from '@/api/api'
  import verificationCode from '@/components/login/yzm.vue'
  export default {
    components: {
      'verification-code': verificationCode
    },
    mounted () {
      this.randomStr()
    },
    data() {
      return {
        isRouterAlive: true,
        local: {
          name: '',
          password: ''
        },
        ruleForm: {
          loginName: '',
          password: '',
          yzPass: ''
        },
        randomNumber: '',
        rules: {
          loginName: [ {required: true, message: '请输入账号', trigger: 'blur'} ],
          password: [ {required: true, message: '请输入密码', trigger: 'blur'} ],
          yzPass: [ {required: true, message: '请输入验证码', trigger: 'blur'} ]
        }
      };
    },
    methods: {
      // 页面刷新
      reload () {
        this.isRouterAlive = false;
        this.$nextTick(() => {
          this.isRouterAlive = true;
        })
      },
      // 登录
      submitForm(formName) {
        let _this = this
        this.$refs[formName].validate((valid) => {
          if (valid) {
            let data = {
              name: _this.ruleForm.loginName,
              password: _this.ruleForm.password,
            }
            api.signIn(data, function (res) {
              if (res && res.data.code === 0) {
                _this.$cookies.set('pass', true, "1d")
                _this.$router.push({ name: 'mainPage' })
                _this.$message.success(res.data.msg)
              } else {
                _this.$message.error(res.data.msg)
              }
            })
          } else {
            this.randomStr()
            return false;
          }
        });
      },
      // 重置
      resetForm(formName) {
        this.reload()
        this.$refs[formName].resetFields();
      },
      // 验证码
      random(max,min) {
        return Math.round(Math.random()*(max-min)+min);
      },
      randomStr() {
        //创建一个空字符，用于存放随机数/字母
        var strData = "";
        //生成随机字符库 (验证码四位，随机数三种，取公倍数12,所以循环4次。也可以是120次，1200次。)
        for(var i=0;i<4;i++){
          var num = this.random(0,9);//生成0-9的随机数
          var az = String.fromCharCode(this.random(97,122));//生成a-z
          var AZ = String.fromCharCode(this.random(65,90));//生成A-Z
          strData = strData + num + az + AZ;//将生成的字符进行字符串拼接
        }
        this.randomNumber = ''
        // 开始真正的随机(从随机字符库中随机取出四个)
        for(var i=0;i<4;i++){
          this.randomNumber += strData[this.random(0,strData.length-1)]
        }
      }
    }
  }
</script>

<style>
.home {
  position: relative;
}
.top {
  height: 38vh;
  width: 100vw;
  background: #4781CA;
  overflow: hidden;
}
.top p {
  color: #FFFFFF;
  font-size: 30px;
  margin: 8% 0 0 10%;
}
.home-center {
  position: absolute;
  top: calc((100vh - 450px) / 2);
  left: calc(((100vw - 850px) / 2));
  width: 850px;
  height: 450px;
  background-color: #FFFFFF;
  border: 1px solid #cccccc;
  box-shadow: 2px 2px 2px 1px rgba(0, 0, 0, 0.2);
  display: flex;
}
.center_left {
  width: 30%;
  height: 286px;
  margin: 0 auto; /*水平居中*/
  position: relative;
  top: 50%; /*偏移*/
  margin-top: -143px;
  margin-left: 30px;
}
.center_right {
  width: 60%;
  height: 286px;
  margin: 0 auto; /*水平居中*/
  position: relative;
  top: 50%; /*偏移*/
  margin-top: -143px;
  margin-right: 30px;
  padding: 20px 0;
}
.center_bottom {
  position: absolute;
  bottom: 20px;
  right: 30px;
}
.bottom {
  height: 62vh;
  width: 100vw;
  background: #FFFFFF;
}
.canvasYzm {
  position: absolute;
  top: 1px;
  right: 6px;
}


.sea {
  width:100vw;
  height:38vh;
  background-color:whitesmoke;
  background-image:linear-gradient(
        darkblue,rgba(255,255,255,0) 80%,rgba(255,255,255,0.5));
  border-radius:5px;
  box-shadow:0 2px 30px rgba(0,0,0,0.2);
  position:relative;
  overflow:hidden;
}
.sea .title {
  color:white;
  font-size:24px;
  text-align:center;
  line-height:250px;
  text-transform:uppercase;
  letter-spacing:0.4em;
  position:absolute;
  z-index:1;
  width:100%;
}
.sea .wave {
  position:absolute;
  width:120%;
  height:100%;
  background:deepskyblue;
  filter:opacity(0.1);
  animation:drift linear infinite;
  transform-origin:50% 48%;
}
.sea .wave:nth-of-type(1) {
  animation-duration:5s;
}
.sea .wave:nth-of-type(2) {
  animation-duration:7s;
}
.sea .wave:nth-of-type(3) {
  animation-duration:9s;
  background-color:orangered;
  filter:opacity(0.1);
}
@keyframes drift {
  from {
  transform:rotate(360deg);
}
}

.loginBtn {
  display: flex;
  justify-content: flex-start;
}
.changePss {
  font-size: 12px;
  color: #666666;
  letter-spacing: 2px;
}
</style>
